ci4/app/Cells/ArtikelTerkini.php

SELECT *
FROM `kategori`
---
     public function show()
    {
        $model = new KategoriModel();
        $kategori = $model->findAll(); // ✅ Ambil semua kategori