ci4/app/Controllers/Artikel.php

SELECT COUNT(*) AS `numrows`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `artikel`.`judul` ASC, `id` ASC
 LIMIT 10
---
    public function admin_index()
    {
        $title = 'Daftar Artikel (Admin)';
        $model = new \App\Models\ArtikelModel();

        $q = $this->request->getVar('q') ?? '';
        $kategori_id = $this->request->getVar('kategori_id') ?? '';
        $page = $this->request->getVar('page') ?? 1;

        // Tambahan untuk sorting
        $sort_by = $this->request->getVar('sort_by') ?? 'id';
        $sort_order = $this->request->getVar('sort_order') ?? 'ASC';

        $builder = $model->table('artikel')
            ->select('artikel.*, kategori.nama_kategori')
            ->join('kategori', 'kategori.id_kategori = artikel.id_kategori')
            ->orderBy('artikel.judul', 'ASC');

        if ($q != '') {
            $builder->like('artikel.judul', $q);
        }

        if ($kategori_id != '') {
            $builder->where('artikel.id_kategori', $kategori_id);
        }

        $builder->orderBy($sort_by, $sort_order); // Sorting aktif

        $artikel = $builder->paginate(10, 'default', $page);

SELECT *
FROM `kategori`
---
            return $this->response->setJSON($data);
        } else {
            $kategoriModel = new \App\Models\KategoriModel();
            $data['kategori'] = $kategoriModel->findAll();

SELECT *
FROM `kategori`
---
    public function add()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'judul' => 'required',
            'isi' => 'required', // Tambah validasi untuk isi
            'id_kategori' => 'required|is_natural_no_zero' // Ganti kategori dengan id_kategori
        ]);
        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $file = $this->request->getFile('gambar');
            $namaFile = $file->getName();
            if ($file->isValid() && !$file->hasMoved()) {
                $file->move(ROOTPATH . 'public/gambar');
            }

            $artikel = new ArtikelModel();
            $artikel->insert([
                'judul' => $this->request->getPost('judul'),
                'isi' => $this->request->getPost('isi'),
                'slug' => url_title($this->request->getPost('judul')),
                'id_kategori' => $this->request->getPost('id_kategori'), // Ganti kategori dengan id_kategori
                'gambar' => $namaFile
            ]);
            return redirect()->to('admin/artikel')->with('success', 'Artikel berhasil ditambahkan'); // Tambah pesan sukses
        }

        $kategoriModel = new \App\Models\KategoriModel();
        $kategori = $kategoriModel->findAll();

SELECT *
FROM `artikel`
WHERE `id` = '14'
 LIMIT 1
SELECT *
FROM `kategori`
---
    public function edit($id)
    {
        $artikel = new \App\Models\ArtikelModel();

        $validation = \Config\Services::validation();
        $validation->setRules([
            'judul' => 'required',
            'id_kategori' => 'required' // Tambah validasi kategori
        ]);

        $isDataValid = $validation->withRequest($this->request)->run();

        if ($isDataValid) {
            $artikel->update($id, [
                'judul'        => $this->request->getPost('judul'),
                'isi'          => $this->request->getPost('isi'),
                'id_kategori'  => $this->request->getPost('id_kategori') // Simpan kategori ID
            ]);
            return redirect()->to('admin/artikel'); // Redirect ke halaman admin
        }

        // Ambil data lama
        $data = $artikel->where('id', $id)->first();
        $title = "Edit Artikel";

        $kategoriModel = new \App\Models\KategoriModel();
        $kategori = $kategoriModel->findAll();