ci4/app/Controllers/Post.php

    public function create()
    {
        $json = $this->request->getJSON();
        if ($json) {
            $data = [
                'judul' => $json->judul,
                'isi'   => $json->isi,
                'status' => $json->status ?? 'draft' // ✅ tambahkan status, default draft
            ];

            $model = new \App\Models\ArtikelModel();
            if ($model->insert($data)) {
---
INSERT INTO `artikel` (`judul`, `isi`, `status`) VALUES ('Tes Ubah Status', 'oke oce publish', '1')

    public function delete($id = null)
    {
        $model = new ArtikelModel();
        $data = $model->where('id', $id)->delete($id);
        if ($data) {
            $model->delete($id);
---
DELETE FROM `artikel`
WHERE `id` = '18'
AND `id` IN ('18')
DELETE FROM `artikel`
WHERE `id` IN ('18')